#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//B站P19
//
int main()
{

	return 0;
}


////B站P19
////位操作符（按位异或）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a ^ b; //00000000000000000000000000000110,最后结果为6
//	printf("%d", c);
//	return 0;
//}


////B站P19
////位操作符（按位或）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a | b; //00000000000000000000000000000111,最后结果为7
//	printf("%d", c);
//	return 0;
//}


////B站P19
////位操作符（按位与）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a & b; //00000000000000000000000000000001,最后结果为1
//	printf("%d", c);
//	return 0;
//}


////B站P19
////移位操作符
//int main()
//{
//	int a = 16; //二进制：00000000000000000000000000010000（32个比特位）
//	int b = a >> 1; //右移操作符
//	printf("%d\n", b);//00000000000000000000000000001000(打印十进制数：8)
//	return 0;
//}


////B站P19
////算数操作符
//int main()
//{
//	double a = 5 / 2.0;
//	printf("a = %lf\n", a); //2.500000
//	return 0;
//}


////B站P19
////算数操作符
//int main()
//{
//	int a = 5 / 2;//除法得到的是商
//	printf("a = %d\n", a); //2
//	return 0;
//}








