#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

////B站P20
////整型提升
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c)); //1
//	printf("%u\n", sizeof(+c)); //正c，要做整型提升，4
//	printf("%u\n", sizeof(!c)); //1
//	return 0;


////B站P20
////整型提升
//int main()
//{
//	char a = 0xb6; //b和6都是16进制数字
//	//b是11：1011(二进制)；6是:0110
//	//0xb6：10110110
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}//最后只打印c，因为a和b要进行整型提升，提升后与原来数字不等
////c就是整型，所以只能打印c（电脑一般只能用int计算）


////B站P20
////隐式类型转换
//int main()
//{
//	char a = 3;
//	//3的二进制序列：00000000000000000000000000000011
//	//因为char只占1个字节的空间，是8个比特位，故a的值为：00000011
//	char b = 127;
//	//127的二进制序列：00000000000000000000000001111111
//	//因为是char，所以b为01111111
//	char c = a + b;
//	//a和b如何相加
//	//整型提升
//	//00000011，a的符号位是0，所以高位全部补0：00000000000000000000000000000011
//	//01111111，b的符号位是0，所以高位全部补0，00000000000000000000000001111111
//	//a+b（二进制位相加）：00000000000000000000000010000010
//	//c是char，所以c的值是：10000010
//	//printf以%d的形式打印，打印的是整型，所以要对c进行整型提升
//	//c的高位（符号位）是1，所以高位全部补1：11111111111111111111111110000010（补码）
//	//转换成原码，打印出来的是原码；c为负数，所以补码和原码不一样
//	//反码：11111111111111111111111110000001
//	//原码：10000000000000000000000001111110
//	printf("%d\n", c); //-126
//	return 0;
//}


////B站P20
////访问一个结构成员
////创建一个结构体类型-struct Stu，相当于建造房子时的图纸结构
//struct Stu  //学生类型
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	int a = 10;
//	struct Stu s1 = { "张三",20,"2019010305" };
//	struct Stu* ps = &s1; //struct Stu是s1的类型
//	printf("%s\n", ps->name);
//	//printf("%s\n", (*ps).name);
//	//printf("%d\n", (*ps).age);
//	//printf("%s\n", (*ps).id);
//	return 0;
//}


////B站P20
////访问一个结构成员
////创建一个结构体类型-struct Stu，相当于建造房子时的图纸结构
//struct Stu  //学生类型
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//int main()
//{
//	int a = 10;
//	//使用struct Stu这个类型创建了一个学生对象，叫s1，并初始化
//	struct Stu s1 = { "张三",20,"2019010305" };
//	printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);//结构体.成员名
//	return 0;
//}


////B站P20
////条件操作符
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = 0;
//	//if (a > b)
//	//	max = a;
//	//else
//	//	max = b;
//	max = (a > b ? a : b);
//	printf("%d\n", max);
//	return 0;
//}


////B站P20
////条件操作符
//int main()
//{
//	int a = 0;
//	int b = 0;
//	//if (a > 5)
//	//	b = 3;
//	//else
//	//	b = -3;
//	//转换成条件表达式
//	b = (a > 5 ? 3 : -3);
//	printf("%d\n", b);
//	return 0;
//}


////B站P20
////逻辑操作符
////求程序输出结果
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//a++是先使用再加加，所以a++为0，逻辑与左边为0，所以d都为0，++b, d++都没算
//	//而a使用了再++，所以a=1；b=2; c=3; d=4
//	printf("a=%d\n b=%d\n c=%d\n d=%d\n", a, b, c, d);
//	//1 2 3 4
//	return 0;
//}


////B站P20
////逻辑操作符
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a && b;
//	printf("%d\n", c);
//	return 0;
//}


////B站P20
////单目操作符
//
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr)); //10*4=40
//	printf("%d\n", sizeof(ch)); //10*1=10
//	test1(arr); //数组传参，传过去的是首元素的地址，32位平台则为4，64位平台则为8
//	test2(ch); //同上，4或8
//	return 0;
//}


////B站P20
////单目操作符
//int main()
//{
//	int a = 11; //00000000000000000000000000001011
//	a = a | (1 << 2);//a和1向左移2位后的值按位或
//	//1：000000000000000000000000000000001
//	//左移两位：00000000000000000000000000000100
//	printf("%d\n", a); //1111，结果是15
//	return 0;
//}


////B站P20
////按位取反（二进制位）
//int main()
//{
//	int a = 0; // 32个0
//	printf("%d\n", ~a); //~a是32个1为-1
//	return 0;
//}


////B站P20
////单目操作符
//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5)); // 2（short只有两个字节）
//	printf("%d\n", s); // 0（sizeof括号里放的表达式是不参与运算的）
//	return 0;
//}


////B站P19
////单目操作符
//int main()
//{
//	int a = 10;
//	char c = 'r';
//	char* p = &c;
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(a)); //4，sizeof计算变量大小可以省略掉a的括号
//	printf("%d\n", sizeof(c)); //1
//	printf("%d\n", sizeof(p)); //4
//	printf("%d\n", sizeof(arr)); //10*4=40
//	return 0;
//}


////B站P19
////位操作符（按位异或）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a ^ b; //00000000000000000000000000000110,最后结果为6
//	printf("%d", c);
//	return 0;
//}


////B站P19
////位操作符（按位或）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a | b; //00000000000000000000000000000111,最后结果为7
//	printf("%d", c);
//	return 0;
//}


////B站P19
////位操作符（按位与）
//int main()
//{
//	int a = 3; //00000000000000000000000000000011
//	int b = 5; //00000000000000000000000000000101
//	int c = a & b; //00000000000000000000000000000001,最后结果为1
//	printf("%d", c);
//	return 0;
//}


////B站P19
////移位操作符
//int main()
//{
//  //正数的补码，反码，原码都相同。换成补码再进行移位操作，打印出来的是原码
//	int a = 16; //二进制：00000000000000000000000000010000（32个比特位）
//	int b = a >> 1; //右移操作符
//	printf("%d\n", b);//00000000000000000000000000001000(打印十进制数：8)
//	return 0;
//}


////B站P19
////算数操作符
//int main()
//{
//	double a = 5 / 2.0;
//	printf("a = %lf\n", a); //2.500000
//	return 0;
//}


////B站P19
////算数操作符
//int main()
//{
//	int a = 5 / 2;//除法得到的是商
//	printf("a = %d\n", a); //2
//	return 0;
//}
